In [1]:
import pandas as pd

In [17]:
import csv

# Metin dosyasını oku ve verileri bir liste olarak depola
with open('sea_depth-salt/sossheig.txt', 'r') as f:
    data = [line.strip().split('\t') for line in f.readlines()]

In [18]:
with open('t.csv', 'w', newline='') as f:
    writer = csv.writer(f)
    writer.writerows(data)

In [19]:
sosaline = pd.read_csv("t.csv")

In [20]:
sosaline.head()

   time_counter            y            x  sossheig
0     6436800.0  "1 of 1021"  "1 of 1442"       NaN
1     6436800.0  "1 of 1021"  "2 of 1442"       NaN
2     6436800.0  "1 of 1021"  "3 of 1442"       NaN
3     6436800.0  "1 of 1021"  "4 of 1442"       NaN
4     6436800.0  "1 of 1021"  "5 of 1442"       NaN

In [21]:
with open('sea_depth-salt/nav_lat.txt', 'r') as f:
    data = [line.strip().split('\t') for line in f.readlines()]
with open('t.csv', 'w', newline='') as f:
    writer = csv.writer(f)
    writer.writerows(data)
lat = pd.read_csv("t.csv")

In [22]:
with open('sea_depth-salt/nav_lon.txt', 'r') as f:
    data = [line.strip().split('\t') for line in f.readlines()]
with open('t.csv', 'w', newline='') as f:
    writer = csv.writer(f)
    writer.writerows(data)
lon = pd.read_csv("t.csv")

In [23]:
lat.head()

             y            x    nav_lat
0  "1 of 1021"  "1 of 1442" -77.010475
1  "1 of 1021"  "2 of 1442" -77.010475
2  "1 of 1021"  "3 of 1442" -77.010475
3  "1 of 1021"  "4 of 1442" -77.010475
4  "1 of 1021"  "5 of 1442" -77.010475

In [24]:
lon.head()

             y            x  nav_lon
0  "1 of 1021"  "1 of 1442"    72.75
1  "1 of 1021"  "2 of 1442"    73.00
2  "1 of 1021"  "3 of 1442"    73.25
3  "1 of 1021"  "4 of 1442"    73.50
4  "1 of 1021"  "5 of 1442"    73.75

In [25]:
sosaline["latitude"] = lat["nav_lat"]
sosaline["longitude"] = lon["nav_lon"]

In [26]:
sosaline.head()

   time_counter            y            x  sossheig   latitude  longitude
0     6436800.0  "1 of 1021"  "1 of 1442"       NaN -77.010475      72.75
1     6436800.0  "1 of 1021"  "2 of 1442"       NaN -77.010475      73.00
2     6436800.0  "1 of 1021"  "3 of 1442"       NaN -77.010475      73.25
3     6436800.0  "1 of 1021"  "4 of 1442"       NaN -77.010475      73.50
4     6436800.0  "1 of 1021"  "5 of 1442"       NaN -77.010475      73.75

In [27]:
sosaline.drop(["time_counter","y","x"],axis=1,inplace=True)

In [28]:
sosaline.head()

   sossheig   latitude  longitude
0       NaN -77.010475      72.75
1       NaN -77.010475      73.00
2       NaN -77.010475      73.25
3       NaN -77.010475      73.50
4       NaN -77.010475      73.75

In [29]:
sosaline.to_csv("sossheigh.csv")